-- данные измерений 

-- новый сотрудник
insert into users (id, full_name, position_id) values
	(3, 'Сидоров Алексей Викторович', 3);

-- пачки измерений
insert into packs (id, user_id, eq_type_id, created_on) values
	(3, 1, 1, date '2026-09-03'),
	(4, 1, 1, date '2026-09-04'),
	(5, 2, 2, date '2026-09-05'),
	(6, 3, 1, date '2026-09-06');

-- измерения (1 высота, 2 температура, 3 давление, 4 направление, 5 скорость, 6 дальность)
insert into parametrs (id, pack_id, parameter_type_id, value) values
	(11, 3, 1, 105), (12, 3, 2, 14), (13, 3, 3, 980), (14, 3, 4, 5), (15, 3, 5, 3),
	(16, 4, 1, 110), (17, 4, 2, 16), (18, 4, 3, 748), (19, 4, 4, 8),
	(20, 5, 1, 120), (21, 5, 2, 18), (22, 5, 3, 745), (23, 5, 4, 30), (24, 5, 6, 60);
